{
    "timeline": {
        "headline": "Story of AAP", 
        "text": "The complete story of Aam Aadmi Party", 
        "type": "default", 
        "asset": {
            "media": "", 
            "caption": "", 
            "credit": "using Pratik Poddar CRSQ"
        }, 
        "date": [
            {
                "headline": "India's Left-Leaning, Anti-Graft Party Made A Stunning Debut", 
                "startDate": "2014,2,1", 
                "asset": {
                    "media": "http://www.businessinsider.in/photo/27328073.cms", 
                    "caption": "", 
                    "credit": "www.businessinsider.in"
                }, 
                "text": "Back in June, crammed with this correspondent into a tiny Suzuki car in east Delhi, he predicted electoral triumph for his Aam Aadmi (\"common man\") anti-graft volunteers. Even as recently as late November Delhi's chief minister for the past 15 years, Sheila Dikshit, was roundly dismissing Mr Kejriwal as an irrelevance. Mr Kejriwal himself toppled Mrs Dikshit <a href='/timeline-news/article/indias-left-leaning-anti-graft-party-made-a-stunning-debut/891' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "AAP workers protest at residences of Delhi CM, MLAs", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://economictimes.indiatimes.com/photo/20139820.cms", 
                    "caption": "", 
                    "credit": "articles.economictimes.indiatimes.com"
                }, 
                "text": "While demonstrating outside the CM's residence, some workers were detained and sent to Tuglak Road Police Station, a statement released by Aam Aadmi Party said. NEW DELHI: Aam Aadmi Party workers today protested outside residences of Delhi Chief Minister Sheila Dikshit and local MLAs on the issues of rising prices of power and water , and women's safety in t <a href='/timeline-news/article/aap-workers-protest-at-residences-of-delhi-cm-mlas/892' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Promises to keep", 
                "startDate": "2010,1,1", 
                "asset": {
                    "media": null, 
                    "caption": "", 
                    "credit": "www.frontline.in"
                }, 
                "text": "Since 2004, the Congress’ electoral strategy has revolved around aam aadmi as a concept, as opposed to India Shining of the BJP-led National Democratic Alliance (NDA), which failed to enthuse the masses. The strategy of focusing on aam aadmi paid the party rich dividends in 2004, when it registered a surprising victory over the BJP. The party promises to enf <a href='/timeline-news/article/promises-to-keep/893' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Anna Hazare confirms rift with Arvind Kejriwal, says his apolitical mass movement will continue", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://timesofindia.indiatimes.com/photo/16456250.cms", 
                    "caption": "", 
                    "credit": "articles.timesofindia.indiatimes.com"
                }, 
                "text": "He is scheduled to have similar consultations in New Delhi and other cities over the next few days, including meetings with Kejriwal, Kiran Bedi and other former Team Anna members. Asked if there was a rift between him and former Team Anna members led by Kejriwal over the formation of a political party, Hazare said, \"It is obvious. Kejriwal and Prashant Bhus <a href='/timeline-news/article/anna-hazare-confirms-rift-with-arvind-kejriwal-says-his-apolitical-mass-movement-will-continue/894' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "So what is the Aam Aadmi Party all about : North, News", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://media2.intoday.in/indiatoday/images/stories//2012november/keju2_660_112412053516.jpg", 
                    "caption": "", 
                    "credit": "indiatoday.intoday.in"
                }, 
                "text": "Over two months after his split with Anna Hazare to take a political plunge, Arvind Kejriwal today launched his party naming it 'Aam Admi with an aim to provide gram sabhas more say in law making and making higher judiciary accessible to common man.The launch of the party came at a day-long meeting of around 320 people here during which the party's Constitut <a href='/timeline-news/article/so-what-is-the-aam-aadmi-party-all-about-north-news/895' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "India activist Arvind Kejriwal's Aam Aadmi Party vows change", 
                "startDate": "2012,11,26", 
                "asset": {
                    "media": "http://news.bbcimg.co.uk/media/images/64380000/jpg/_64380876_64377539.jpg", 
                    "caption": "", 
                    "credit": "www.bbc.co.uk"
                }, 
                "text": "He announced plans for a new party on 2 October, the birth anniversary of independence hero Mahatma Gandhi. His colleague, Manish Sisodia, announced the names of the 23 members of the party's national executive body. A former bureaucrat, Mr Kejriwal won the Ramon Magsaysay award in 2006 for social work and initiatives to fight corruption. Two years ago, the  <a href='/timeline-news/article/india-activist-arvind-kejriwals-aam-aadmi-party-vows-change/896' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Arvind Kejriwal's answer to Congress's 'mango people', names his political front as Aam Aadmi Party : North, News", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://media2.intoday.in/indiatoday/images/stories/kejriwal_350_112412113422.jpg", 
                    "caption": "", 
                    "credit": "indiatoday.intoday.in"
                }, 
                "text": "The formation of the party came after a bitter split with Anna Hazare over the question of the anti-corruption movement taking a political plunge as Kejriwal desired. During the August fast, Hazare and Kejriwal ended the agitation saying they will work for providing a political alternative for the country to fight both Congress and BJP. However, both Hazare  <a href='/timeline-news/article/arvind-kejriwals-answer-to-congresss-mango-people-names-his-political-front-as-aam-aadmi-party-north-news/897' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Arvind Kejriwal formally launches Aam Aadmi Party : North, News", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://media2.intoday.in/indiatoday/images/stories/arvind_350_112612094648.jpg", 
                    "caption": "", 
                    "credit": "indiatoday.intoday.in"
                }, 
                "text": "These include Sisodia himself as well as Prashant Bhushan, Dinesh Waghela, Sanjay Singh, Gopa Rai and Kumar Vishwas. Pankaj Gupta would be the national secretary, Krishna Kanth would be national treasurer of AAP,\" Waghela said.Earlier in the day, Kejriwal and his colleagues visited Mahatma Gandhi's memorial Raj Ghat. Ambedkar.Kejriwal's chose to launch his p <a href='/timeline-news/article/arvind-kejriwal-formally-launches-aam-aadmi-party-north-news/898' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Aam Aadmi Party now a registered political party", 
                "startDate": "2013,3,23", 
                "asset": {
                    "media": "http://www.thehindu.com/template/1-0-1/gfx/oghindu.jpg", 
                    "caption": "", 
                    "credit": "www.thehindu.com"
                }, 
                "text": "As activist and party convenor Arvind Kejriwal goes on a “fast” in Nandnagari here from Saturday against inflated water and power bills, the party received a communication from the Election Commission on Friday that it had registered the AAP as a “political party” under Section 29A of the Representation of the People Act, 1951, with effect from March 21, 201 <a href='/timeline-news/article/aam-aadmi-party-now-a-registered-political-party/899' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Aam Aadmi Party, India", 
                "startDate": "2010,1,1", 
                "asset": {
                    "media": "http://delhi.aamaadmiparty.org/sites/default/files/aap.png", 
                    "caption": "", 
                    "credit": "www.aamaadmiparty.org"
                }, 
                "text": "These chosen few then betray the trust of the common man and make unfair and corrupt policies and take unilateral decisions that affect the lives of millions of Indians. In these countries if a majority of the population consider a law unfit for the people, they can reject it and send it back to their elected representatives. We will enact a Right to law whe <a href='/timeline-news/article/aam-aadmi-party-india/900' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Will implement voters' right to reject candidates straight away: Election Commission", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://economictimes.indiatimes.com/photo/23171891.cms", 
                    "caption": "", 
                    "credit": "articles.economictimes.indiatimes.com"
                }, 
                "text": "NEW DELHI: The Election Commission on Friday said it would straight away implement the Supreme Court judgment directing it to provide a \"None of the Above\" button on electronic voting machines (EVMs). As former CEC N Gopalaswami explained to TOI, \"Even if 90 voters in an electorate of 100 persons press the NOTA button, the poll will be decided in favour of t <a href='/timeline-news/article/will-implement-voters-right-to-reject-candidates-straight-away-election-commission/901' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Shanti Bhushan donates Rs. 1 crore to Kejriwal's Aam Aadmi Party", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://www.hindustantimes.com/images/2012/11/99e581f0-da90-4652-a5da-ad509369e310cinemaphotourl.jpg", 
                    "caption": "", 
                    "credit": "www.hindustantimes.com"
                }, 
                "text": "Former law minister Shanti Bhushan on Monday donated Rs. 1 crore to the newly-launched Aam Aadmi Party and said people from all walks of society will sit in Parliament after the 2014 general elections. Bhushan, whose son Prashant is a member of the AAP's national executive, donated Rs. Speaking at the rally, Shanti Bhushan said people of the country have \"st <a href='/timeline-news/article/shanti-bhushan-donates-rs-1-crore-to-kejriwals-aam-aadmi-party/902' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Kejriwal's indefinite fast in Delhi", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://timesofindia.indiatimes.com/photo/10905539.cms", 
                    "caption": "", 
                    "credit": "articles.timesofindia.indiatimes.com"
                }, 
                "text": "After visiting Raj Ghat and Shaheed Park here, Kejriwal reached the home of one Santosh in Sundar Nagri where he began his fast. He had chosen this house as Santosh had allegedly received inflated bills and had to take loans to pay it. Kejriwal earlier had announced that his family residing in Uttar Pradesh will not pay the bills in solidarity with the prote <a href='/timeline-news/article/kejriwals-indefinite-fast-in-delhi/903' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Civil society groups support Kejriwals campaign against inflated power bills", 
                "startDate": "2013,4,3", 
                "asset": {
                    "media": "http://www.thehindu.com/template/1-0-1/gfx/oghindu.jpg", 
                    "caption": "", 
                    "credit": "www.thehindu.com"
                }, 
                "text": "Civil society group National Alliance of People’s Movement (NAPM) has also come out in support of Aam Aadmi Party leader Arvind Kejriwal in his indefinite fast against “inflated” power bills. Backing Mr. Kejriwal’s allegations of “collusion between authorities in government, discoms and regulator resulting in corrupt practices and arbitrarily high tariffs fo <a href='/timeline-news/article/civil-society-groups-support-kejriwals-campaign-against-inflated-power-bills/904' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Will work at sit-in, files are being delivered to me: Arvind Kejriwal", 
                "startDate": "2014,1,20", 
                "asset": {
                    "media": "http://www.ndtv.com/news/images/story_page/Arvind_Kejriwal_files_360_20Jan14.jpg", 
                    "caption": "", 
                    "credit": "www.ndtv.com"
                }, 
                "text": "After announcing that he will lead a 10-day demonstration in Delhi, Chief Minister Arvind Kejriwal made it clear that the protest will not impede his work. \"The people are frustrated with an ineffective police force,\" said Yogendra Yadav, a senior leader of Mr Kejriwal's Aam Aadmi Party (AAP), justifying the demonstration. Vote here Law Minister Somnath Bhar <a href='/timeline-news/article/will-work-at-sit-in-files-are-being-delivered-to-me-arvind-kejriwal/905' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "AAP leaders shout at cops, allege supporters are being detained, beaten up", 
                "startDate": "2014,1,20", 
                "asset": {
                    "media": "http://www.ndtv.com/news/images/story_page/Arvind_Kejriwal_Manish_Sisodia_Somnath_Bharti_650_20Jan14.jpg", 
                    "caption": "", 
                    "credit": "www.ndtv.com"
                }, 
                "text": "( Track LIVE updates here Union Home Minister Sushil Kumar Shinde has said there is no question of any action till an enquiry is completed. Mr Kejriwal says that's unacceptable.In the evening, leaders from his party were seen on camera arguing aggressively with the police about allegedly beating up their supporters including a law-maker named Akhilesh Tripat <a href='/timeline-news/article/aap-leaders-shout-at-cops-allege-supporters-are-being-detained-beaten-up/906' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "It is people's victory, says Arvind Kejriwal", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://economictimes.indiatimes.com/photo/29169962.cms", 
                    "caption": "", 
                    "credit": "articles.economictimes.indiatimes.com"
                }, 
                "text": "Governor Najeeb Jung announced that he was sending on leave two of the five policemen against whom Kejriwal wanted action, the chief minister said: \"People of Delhi have won a battle. \" Delhi Chief Minister Arvind Kejriwal declared Tuesday as he called off an unprecedented street protest demanding action against allegedly errant policemen. \"It is for the fir <a href='/timeline-news/article/it-is-peoples-victory-says-arvind-kejriwal/907' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Arvind Kejriwal calls off sit-in that gridlocked Delhi, shocked Centre", 
                "startDate": "2014,1,22", 
                "asset": {
                    "media": "http://www.ndtv.com/news/images/Arvind_Kejriwal_callsoff_protest_PTI_360_7.jpg", 
                    "caption": "", 
                    "credit": "www.ndtv.com"
                }, 
                "text": "Chief Minister Arvind Kejriwal agreed on Tuesday evening to truncate the demonstration that left the heart of Delhi grid-locked, forced chaos upon commuters, and threatened to impede security and other arrangements needed for Sunday's Republic Day parade. \"This is a victory for Delhi,\" Mr Kejriwal, 45, announced on Tuesday evening, surrounded by supporters i <a href='/timeline-news/article/arvind-kejriwal-calls-off-sit-in-that-gridlocked-delhi-shocked-centre/908' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "AAP picks candidates: Filmmaker, homemaker and loyalists", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://s1.firstpost.in/wp-content/uploads/2013/05/Aap-Moushree-Guha-Danish-380.jpg", 
                    "caption": "", 
                    "credit": "www.firstpost.com"
                }, 
                "text": "A day after he wrapped up the shoot of his latest film Sejiya bhayil ajor (I have got back my husband) in Nepal, Tiwary is ensconced in Aam Aadmi Partys office on Delhi-Ghaziabad border. Aspirants have been thronging to the AAP office since 16 April when the party invited applications from those who wanted to contest Delhi assembly election on its ticket. Th <a href='/timeline-news/article/aap-picks-candidates-filmmaker-homemaker-and-loyalists/917' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Arvind Kejriwal cries conspiracy, Shazia Ilmi offers to resign", 
                "startDate": "2014,2,3", 
                "asset": {
                    "media": "https://i1.ytimg.com/vi/9hrh3lz2jOc/hqdefault.jpg", 
                    "caption": "", 
                    "credit": "zeenews.india.com"
                }, 
                "text": "I offer to withdraw my candidature and not contest elections until and unless my name is cleared\", Ilmi said.Dismissing the sting operation as a conspiracy against his party, AAP convener Arvind Kejriwal said he knew who were behind it as BJP and Congress have been routed by AAP.In a bid to pacify the whole situation, Kejriwal said on a microblogging website <a href='/timeline-news/article/arvind-kejriwal-cries-conspiracy-shazia-ilmi-offers-to-resign/909' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "EC begins inquiry into sting operation against AAP leaders : Delhi, News", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://media2.intoday.in/indiatoday/images/stories//2013november/kejriwal_350_112013073540.jpg", 
                    "caption": "", 
                    "credit": "indiatoday.intoday.in"
                }, 
                "text": "The Election Commission has started investigation into the sting operation allegedly showing Aam Aadmi Party leaders like Shazia Ilmi raising funds through \"illegal\" means after procuring the CD from the media portal.AAP convener Arvind Kejriwal along with Yogendra Yadav and other party leaders met Chief Election Commissioner V.S. Sampath and the Election Co <a href='/timeline-news/article/ec-begins-inquiry-into-sting-operation-against-aap-leaders-delhi-news/910' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "Fulfill promises, Sheila Dikshit tells Aam Aadmi Party", 
                "startDate": "2013,12,23", 
                "asset": {
                    "media": "http://www.ndtv.com/news/2013/12/23/images/story_page/sheila_speaks_360.jpg", 
                    "caption": "", 
                    "credit": "www.ndtv.com"
                }, 
                "text": "Former Delhi chief minister Sheila Dikshit on Monday gave her \"best wishes\" to the Aam Aadmi Party (AAP) and asked the party to fulfill the promises it made to the people. \"Our best wishes to them to fulfil their promises. We gave outside support to them to form (a) government and will continue to give support till they fulfill the promises,\" Ms Dikshit told <a href='/timeline-news/article/fulfill-promises-sheila-dikshit-tells-aam-aadmi-party/911' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "'Aam Admi' Arvind Kejriwal takes oath as Delhi CM, vows change in governance", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://timesofindia.indiatimes.com/photo/28048145.cms", 
                    "caption": "", 
                    "credit": "timesofindia.indiatimes.com"
                }, 
                "text": "NEW DELHI: Arvind Kejriwal , whose AAP has rewritten the grammar of politics in Delhi and may possibly do so elsewhere, on Saturday took oath as Delhi chief minister promising a corruption-free government and new style of governance without arrogance of power.45-year-old Kejriwal, a former revenue service official, who broke from Anna Hazare's campaign for L <a href='/timeline-news/article/aam-admi-arvind-kejriwal-takes-oath-as-delhi-cm-vows-change-in-governance/912' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "AAP gears for Lok Sabha polls, to contest all seats in Gujarat, Haryana", 
                "startDate": "2014,1,5", 
                "asset": {
                    "media": "http://static.indianexpress.com/t-images/T_Id_456610_Devyani_Khobragade.jpg", 
                    "caption": "", 
                    "credit": "archive.indianexpress.com"
                }, 
                "text": "Days after forming a minority government and winning the trust vote in the Delhi Assembly, a buoyant (AAP) has begun planning its debut in the Lok Sabha elections, with leaders saying Saturday that the party would contest at least 300 seats in the polls due this summer. Bhushan said AAP wasn't unduly worried about the seemingly bipolar fight for power at the <a href='/timeline-news/article/aap-gears-for-lok-sabha-polls-to-contest-all-seats-in-gujarat-haryana/913' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "AAP to contest all Lok Sabha seats in Maharashtra: Anjali Damania", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://economictimes.indiatimes.com/photo/28562992.cms", 
                    "caption": "", 
                    "credit": "articles.economictimes.indiatimes.com"
                }, 
                "text": "AKOLA: Anjali Damania, the convener of Maharashtra unit of Aam Admi Party, has said her party would contest all the 48 Lok Sabha seats in the state. Damania was addressing a press conference here late last evening. As many as 73,000 aspirants had filed applications all over the country for AAP tickets for Lok Sabha poll so far before the January 15 deadline, <a href='/timeline-news/article/aap-to-contest-all-lok-sabha-seats-in-maharashtra-anjali-damania/914' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "One month of Arvind Kejriwal's government: Five hits and five misses", 
                "startDate": "2014,1,28", 
                "asset": {
                    "media": "http://www.ndtv.com/news/arvind_kejriwal650.jpg", 
                    "caption": "", 
                    "credit": "www.ndtv.com"
                }, 
                "text": "Miss: Mr Kejriwal is facing strong demands for his Law Minister Somnath Bharti's sacking over his vigilante-style raid on an alleged sex and drugs ring in his constituency that targeted African nationals. Hit: Mr Kejriwal and his ministers stood by their pledge to banish \"VIP culture\", and shunned its most blatant symbols like big bungalows, heavy security a <a href='/timeline-news/article/one-month-of-arvind-kejriwals-government-five-hits-and-five-misses/915' target='_blank'> .. more ..</a>"
            }, 
            {
                "headline": "After facing extreme reactions on Prashant Bhushan's AFSPA remark, AAP keeps silent", 
                "startDate": "2014,2,2", 
                "asset": {
                    "media": "http://economictimes.indiatimes.com/photo/28570628.cms", 
                    "caption": "", 
                    "credit": "articles.economictimes.indiatimes.com"
                }, 
                "text": "NEW DELHI: The political controversy over senior leader Prashant Bhushan's comment on deployment of army in Jammu and Kashmir spiralled out of control on Wednesday as the Aam Aadmi Party's head office in Ghaziabad was vandalised by activists of a rightwing group. This consensus among the senior leadership came after 40 activists of Hindu Raksha Dal vandalise <a href='/timeline-news/article/after-facing-extreme-reactions-on-prashant-bhushans-afspa-remark-aap-keeps-silent/916' target='_blank'> .. more ..</a>"
            }
        ]
    }
}
